Tekla.Structures.ModelInternal.dotDeformingData_t
Struct for the DeformingData.

Tekla.Structures.ModelInternal.dotDeformingData_t.Angle
Start angle.

Tekla.Structures.ModelInternal.dotDeformingData_t.Angle2
End angle.

Tekla.Structures.ModelInternal.dotDeformingData_t.Cambering
Cambering degree.

Tekla.Structures.ModelInternal.dotDeformingData_t.Shortening
Shortening degree.